app/views/items/index.html.erb

    <td><%= item.price %></td>
    <td><%= item.user.name if item.user.present? %></td>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1